//
// Created by zww on 8/13/17.
//
/*
 * 中国古代数学家张丘建在他的《算经》中提出了一个著名的“百钱买鸡问题”，
 * 鸡翁一，值钱五，鸡母一，值钱三，鸡雏三，值钱一，
 * 百钱买百鸡，问翁，母，雏几何？
 */

#include <stdio.h>

int main() {
    int a, b, c;//定义每种买了多少只
    int a_m = 5, b_m = 3;
    for (a = 0; a <= 100 / 5; a++) {
        for (b = 0; b <= 33; b++) {
            for (c = 0; c <= 100; c += 3) {
                if ((a * a_m + b * b_m + c / 3 == 100) && (a + b + c == 100)) {
                    printf("鸡翁： %d 只，鸡母 %d 只，鸡雏 %d 只\n", a, b, c);
                }
            }
        }
    }
    return 0;
}
